{
  "subject": "Monkey D. Luffy",
  "bio": "Luffy, the captain of the Straw Hat Pirates, is a reckless idealist driven by freedom and loyalty. He acts purely on instinct and protects his friends and anyone oppressed. Standing up for others or pursuing his dream counts as success. Abandoning a friend or being constrained by fear or authority counts as failure. Being outsmarted or humiliated without fighting back is disgraceful.",
  "agendas": [
    {
      "chapter": 1063,
      "event": "Bonney kicks him in the face after attempting to attack a Pacifista."
    },
    {
      "chapter": 1064,
      "event": "Off-screened by Bonney’s age powers, could’ve used Haki to turn normal if he wanted to."
    },
    {
      "chapter": 1069,
      "event": "Dog walked Lucci, didn’t even bother finishing him off."
    },
    {
      "chapter": 1069,
      "event": "Let Sentomaru get stabbed by Lucci (he was having too much fun)."
    },
    {
      "chapter": 1075,
      "event": "Fights the Seraphim with Zoro while protecting Lucci and Kaku."
    },
    {
      "chapter": 1076,
      "event": "Released Lucci and slandered him in the process."
    },
    {
      "chapter": 1076,
      "event": "Forgot he had ACoC and struggled against the Seraphim."
    },
    {
      "chapter": 1090,
      "event": "Got S-Snake to undo her stone powers on his crewmates."
    },
    {
      "chapter": 1092,
      "event": "Gets kinda bodied by Kizaru while in Snakeman form."
    },
    {
      "chapter": 1092,
      "event": "Giant Gear 5 Luffy catches the fastest man alive off guard."
    },
    {
      "chapter": 1093,
      "event": "Crewmate gets choked out while he’s distracted by the light clones."
    },
    { "chapter": 1094, "event": "Beats Kizaru in 'Round 1'." },
    {
      "chapter": 1106,
      "event": "Gets back up and attacks Kizaru, preventing him from hurting the group."
    },
    {
      "chapter": 1107,
      "event": "Brushes off Saturn’s eyesight attack then hits him with a Dawn Gatling Gun."
    },
    {
      "chapter": 1108,
      "event": "Grabs both Kizaru and Saturn, looks menacing in Gear 5 for once."
    },
    {
      "chapter": 1109,
      "event": "Pancakes 2 top-tiers at once, Kizaru is now too depressed to keep fighting."
    },
    {
      "chapter": 1110,
      "event": "Begins fighting 5 Elders pretty much by himself."
    },
    {
      "chapter": 1110,
      "event": "Needs to be saved from Ju Peter by Dorry and Brogy."
    },
    {
      "chapter": 1111,
      "event": "Takes a page out of Mihawk’s book, returns Saturn’s attack back to him with a painted baseball bat."
    },
    {
      "chapter": 1112,
      "event": "Can't do any damage to Topman with Red Roc, takes recoil damage."
    },
    {
      "chapter": 1114,
      "event": "Can't do any damage to Topman with the same attack but in Gear 5th, takes recoil damage again."
    },
    {
      "chapter": 1118,
      "event": "Somehow gets Bonney to realize she is Nika 2.0."
    },
    {
      "chapter": 1119,
      "event": "Sent the most competent Gorosei back to the lobby with a combined attack, all while tanking his allies’ strongest attacks."
    },
    {
      "chapter": 1121,
      "event": "Combined attack with Bonney against Saturn (does most of the work)."
    }
  ]
}
