{
  "subject": "Roronoa Zoro",
  "bio": "Zoro, the crew’s swordsman, lives by honor, discipline, and ambition. His goal is to become the world’s greatest swordsman, and he values strength and loyalty above all. Winning through skill or enduring pain to protect his captain counts as success. Breaking his word or losing without resolve counts as failure. Showing weakness or hesitation in combat is shameful.",
  "agendas": [
    { "chapter": 1060, "event": "Cut the water eddy/afro, saving Bonney." },
    {
      "chapter": 1062,
      "event": "Empty threat to the Vegapunk robot (he never followed up on this)."
    },
    {
      "chapter": 1065,
      "event": "Thanks Caribou for helping Luffy in Wano (Caribou later escapes with crucial information that will certainly get leaked to Blackbeard)."
    },
    { "chapter": 1071, "event": "Protected Sunny from Kaku's attack." },
    {
      "chapter": 1072,
      "event": "Brief clash with Kaku (Zoro has the clear advantage)."
    },
    { "chapter": 1072, "event": "Stussy steals his W." },
    {
      "chapter": 1073,
      "event": "Brief clash with S-Hawk, makes him sweat a little."
    },
    {
      "chapter": 1075,
      "event": "Fights Seraphim with Luffy, protecting Kaku and Lucci."
    },
    {
      "chapter": 1076,
      "event": "Team up with Kaku against Seraphim (no damage)."
    },
    {
      "chapter": 1077,
      "event": "Shows us that his Battle IQ needs work. Took too long to figure out the Seraphim were just like the opponent he just fought (3-IQ Style)."
    },
    {
      "chapter": 1078,
      "event": "Struggles against Seraphim even after remembering King's flame gimmick."
    },
    {
      "chapter": 1091,
      "event": "Attacks Lucci (base) after Stussy goes down, saving Vegapunk."
    },
    {
      "chapter": 1093,
      "event": "Pushes Lucci out of base (needs all 3 swords and KOH flames to do it)."
    },
    {
      "chapter": 1107,
      "event": "Zoro is having an asthma attack against Lucci, pretends to be in control of the fight (really bad)."
    },
    {
      "chapter": 1109,
      "event": "6-month anniversary of Zoro 'stalling' Lucci."
    },
    {
      "chapter": 1110,
      "event": "Is called a liability by both friend and foe (Sanji and Lucci)."
    },
    {
      "chapter": 1110,
      "event": "Zoro finally lands a killer blow on Lucci."
    },
    {
      "chapter": 1111,
      "event": "Lucci is still standing, Jinbe steals his W."
    },
    {
      "chapter": 1117,
      "event": "Protects the ship by clashing with Ghandi, both get knocked back a few feet (impressive)."
    },
    {
      "chapter": 1120,
      "event": "His contribution to preparing the Sunny is telling Brook to floor it while looking confused about what’s going on with Atlas and Lilith."
    },
    {
      "chapter": 1124,
      "event": "Had the gall to out Luffy for being sad over 'some old man', forgot that he was sad over Yasuie last arc."
    }
  ]
}
